### Starter code for Project 4. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [23]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [24]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'reliable-
sight-339421:school_enrollments' already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/stanford-school-enrollment/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ak.csv

Waiting on bqjob_r52af853338eccb7e_0000017f52a93707_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ar.csv

Waiting on bqjob_r66a8c167051e5f4e_0000017f52a9499d_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.az gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_az.csv

Waiting on bqjob_r4df8556691c27545_0000017f52a96091_1 ... (6s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ca.csv

Waiting on bqjob_r1e1de608391ac160_0000017f52a984da_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ct.csv

Waiting on bqjob_r1944f9ba3f1f1c6c_0000017f52a9b4dc_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_hi.csv

Waiting on bqjob_r3970ecc3079f00f7_0000017f52a9cbf6_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.in gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_in.csv

Waiting on bqjob_r6513df276a47d8bb_0000017f52a9dea8_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_la.csv

Waiting on bqjob_r47fc9efe004ff374_0000017f52a9f9ff_1 ... (34s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_md.csv

Waiting on bqjob_r44c06ab5514b3369_0000017f52aa898f_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_mn.csv

Waiting on bqjob_r734ba47b420ae81c_0000017f52aa9c07_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ms.csv

Waiting on bqjob_r6a9bcf3ef5862aca_0000017f52aabb55_1 ... (1s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nh.csv

Waiting on bqjob_r1f283c6bc4d5f047_0000017f52aacacf_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nj gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nj.csv

Waiting on bqjob_r6fdf42f56f41c451_0000017f52aadde5_1 ... (1s) Current status: DONE

BigQuery error in load operation: Error processing job 'reliable-
sight-339421:bqjob_r6fdf42f56f41c451_0000017f52aadde5_1': Error while reading
data, error message: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632  with message
'Unable to parse'
Failure details:
- Error while reading data, error message: CSV processing encountered
too many errors, giving up. Rows: 12208; errors: 1; max bad: 0;
error percent: 0
- query: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632
with message 'Unable to parse'
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nm gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nm.csv

Waiting on bqjob_r1e1bcfce235b81e7_0000017f52aaec5a_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nv.csv

Waiting on bqjob_rfa4ad95f09ef23a_0000017f52aafebe_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ok.csv

Waiting on bqjob_rd213886911156e3_0000017f52ab111c_1 ... (7s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_pa.csv

Waiting on bqjob_r733358f94ad71da7_0000017f52ab3920_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_sc.csv

Waiting on bqjob_r6d0c842d42e17dcd_0000017f52ab5848_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_tx.csv

Waiting on bqjob_r579ac3e6c8c0eb4a_0000017f52ab6ace_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ut gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ut.csv

Waiting on bqjob_r228d316d9a6fe891_0000017f52ab8638_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wa.csv

Waiting on bqjob_r700b26d90f87785c_0000017f52ab98dd_1 ... (4s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wy.csv

Waiting on bqjob_r29de8e81b7aed103_0000017f52abb38a_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1878.89query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1147.43rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   1440
1     AKINS H S          grade_10  2021   1494
2     AKINS H S          grade_11  2020   1328
3     AKINS H S          grade_11  2021   1326
4     AKINS H S          grade_12  2020   1218
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    138
1735  ZILKER EL      kindergarten  2020    154
1736  ZILKER EL      kindergarten  2021    126
1737  ZILKER EL  pre_kindergarten  2020     60
1738  ZILKER EL  pre_kindergarten  2021     26

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [7]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'reliable-sight-339421:views' already
exists.

In [8]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: 0ea3cb8b-aa65-46aa-aeb0-067be98a2c99
Query executing: 0.34s

ERROR:
 409 Already Exists: Table reliable-sight-339421:views.austin_enrollments_by_school_grade_year

(job ID: 0ea3cb8b-aa65-46aa-aeb0-067be98a2c99)

                                    -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:create view views.austin_enrollments_by_school_grade_year as
   2:select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
   3:from school_enrollments.tx
   4:where total != "" and school != "" and district like '%AUSTIN%'
   5:group by school, grade, year
   6:order by school, grade, year
    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |

In [9]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1054.29query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1200.21rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   1440
1     AKINS H S          grade_10  2021   1494
2     AKINS H S          grade_11  2020   1328
3     AKINS H S          grade_11  2021   1326
4     AKINS H S          grade_12  2020   1218
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    138
1735  ZILKER EL      kindergarten  2020    154
1736  ZILKER EL      kindergarten  2021    126
1737  ZILKER EL  pre_kindergarten  2020     60
1738  ZILKER EL  pre_kindergarten  2021     26

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 4 homework marker. Start homework from here.

In [138]:
%%bigquery
select school, sum(cast(replace(replace(female, ",", ""), "<", "") as int64)) as female
from school_enrollments.tx
where female != ""
group by school
order by female DESC, school

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1004.86query/s]
Downloading: 100%|██████████| 8089/8089 [00:01<00:00, 6719.47rows/s]

                                  school    female
0                                         10606718
1                           MEMORIAL H S     18908
2     TEXAS VIRTUAL ACADEMY AT HALLSVILL     18650
3     TEXAS CONNECTIONS ACADEMY AT HOUST     16830
4                          MACARTHUR H S     16616
...                                  ...       ...
8084             WILLIAMSON CO J J A E P        20
8085              WILLIAMSON COUNTY CORE        20
8086             WILSON COUNTY BOOT CAMP        20
8087                WINTERS/FAIRVIEW AEP        20
8088                       WOMEN'S HAVEN        20

[8089 rows x 2 columns]

In [149]:
%%bigquery
SELECT ccd_district_type, count(*)
FROM school_enrollments.ca
WHERE year = 2020
group by ccd_district_type
UNION DISTINCT
SELECT ccd_district_type, count(*)
FROM school_enrollments.tx
WHERE year = 2020
group by ccd_district_type
order by 2 desc

Query complete after 0.00s: 100%|██████████| 5/5 [00:00<00:00, 3380.87query/s]
Downloading: 100%|██████████| 8/8 [00:01<00:00,  6.25rows/s]

  ccd_district_type     f0_
0                    296464
1                    117786
2               1.0   31726
3               1.0   27468
4               7.0    3914
5               2.0     280
6               7.0     224
7               5.0     112

In [97]:
%%bigquery
SELECT county, count(*)
FROM school_enrollments.ca
group by county
UNION ALL
SELECT county, count(*)
FROM school_enrollments.tx
group by county
order by 2 desc

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2724.02query/s]
Downloading: 100%|██████████| 369/369 [00:01<00:00, 287.98rows/s]

             county     f0_
0       LOS ANGELES  130872
1         SAN DIEGO   45920
2            ORANGE   37184
3    SAN BERNARDINO   33684
4     HARRIS COUNTY   30592
..              ...     ...
364          Plumas      56
365       Del Norte      56
366        Mariposa      56
367          Alpine      28
368          Sierra      28

[369 rows x 2 columns]

In [78]:
%%bigquery
SELECT max(county), total
FROM school_enrollments.ca
group by total
having total > 100
order by 2 desc

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2474.03query/s]
Downloading: 100%|██████████| 3942/3942 [00:01<00:00, 3128.60rows/s]

              f0_     total
0     Los Angeles  604074.0
1     LOS ANGELES  572859.0
2       San Diego  123533.0
3       SAN DIEGO  118210.0
4          Fresno   73190.0
...           ...       ...
3937         YOLO     105.0
3938         YOLO     104.0
3939         YUBA     103.0
3940         YUBA     102.0
3941         YOLO     101.0

[3942 rows x 2 columns]

In [86]:
%%bigquery
SELECT max(free_and_reduced) free_and_reduced, ell
FROM school_enrollments.ca
group by ell
having ell > 20.0
%%order by 2 asc

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2084.30query/s]
Downloading: 100%|██████████| 601/601 [00:01<00:00, 507.69rows/s]

    free_and_reduced     ell
0               99.0    21.0
1               99.0    22.0
2               97.0    23.0
3               99.0    24.0
4               97.0    25.0
..               ...     ...
596           2567.0  1379.0
597           2529.0  1431.0
598           2123.0  2387.0
599                   2835.0
600           3086.0  3013.0

[601 rows x 2 columns]

In [90]:
%%bigquery
select school school, max(year) year
from views.austin_enrollments_by_school_grade_year
where year = 2020
group by school

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2231.41query/s]
Downloading: 100%|██████████| 141/141 [00:01<00:00, 126.27rows/s]

                                 school  year
0                    AUSTIN ACHIEVE H S  2020
1                             AKINS H S  2020
2           ALTERNATIVE LEARNING CENTER  2020
3                          ANDERSON H S  2020
4                            AUSTIN H S  2020
..                                  ...   ...
136    HARMONY SCIENCE ACADEMY - AUSTIN  2020
137  HARMONY SCIENCE ACADEMY - CEDAR PA  2020
138   STEPHEN F AUSTIN STATE UNIVERSITY  2020
139  AUSTIN ISD CHILD DEVELOPMENT CENTE  2020
140                  MAINSPRING SCHOOLS  2020

[141 rows x 2 columns]

In [207]:
%%bigquery
SELECT max(admin_level), county, total
FROM school_enrollments.tx
group by total, county
having total > 100.0
order by total DESC, county

Executing query with job ID: 7a005542-bf5c-46c3-ae84-6183df72d522
Query executing: 0.32s

ERROR:
 400 No matching signature for operator > for argument types: STRING, FLOAT64. Supported signature: ANY > ANY at [4:8]

(job ID: 7a005542-bf5c-46c3-ae84-6183df72d522)

      -----Query Job SQL Follows-----

    |    .    |    .    |    .    |
   1:SELECT max(admin_level), county, total
   2:FROM school_enrollments.tx
   3:group by total, county
   4:having total > 100.0
   5:order by total DESC, county
    |    .    |    .    |    .    |

In [203]:
%%bigquery
select grade grade, count(*) Enrollments
from views.austin_enrollments_by_school_grade_year
where year = 2021
group by grade

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1926.94query/s]
Downloading: 100%|██████████| 15/15 [00:01<00:00, 11.97rows/s]

               grade  Enrollments
0            grade_9           28
1           grade_10           28
2           grade_11           26
3           grade_12           24
4            grade_5           88
5            grade_6           31
6            grade_7           28
7            grade_8           30
8    early_education           48
9       kindergarten           88
10           grade_1           87
11           grade_2           87
12           grade_3           87
13           grade_4           87
14  pre_kindergarten           79

In [204]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1542.40query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1355.57rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   1440
1     AKINS H S          grade_10  2021   1494
2     AKINS H S          grade_11  2020   1328
3     AKINS H S          grade_11  2021   1326
4     AKINS H S          grade_12  2020   1218
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    138
1735  ZILKER EL      kindergarten  2020    154
1736  ZILKER EL      kindergarten  2021    126
1737  ZILKER EL  pre_kindergarten  2020     60
1738  ZILKER EL  pre_kindergarten  2021     26

[1739 rows x 4 columns]

In [217]:
%%bigquery
create view views.california_low_income_demographics_2 as
select county, low_income, homeless, district from school_enrollments.ca
where county != '' and  low_income != 0  and  homeless > 0 and district != ''
group by county, low_income, homeless, district
order by county, low_income, homeless, district

Executing query with job ID: 653e3cfd-ad13-45d0-ad23-3a92339848f7
Query executing: 0.27s

ERROR:
 400 No matching signature for operator > for argument types: STRING, INT64. Supported signature: ANY > ANY at [3:25]

(job ID: 653e3cfd-ad13-45d0-ad23-3a92339848f7)

                         -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:create view views.california_low_income_demographics_2 as
   2:select county, low_income, homeless, district from school_enrollments.ca
   3:where county != '' and  low_income > 0  and  homeless > 0 and district != ''
   4:group by county, low_income, homeless, district
   5:order by county, low_income, homeless, district
    |    .    |    .    |    .    |    .    |    .    |    .    |    .    |

In [205]:
%%bigquery
select * from school_enrollments.ut

Query complete after 0.00s: 100%|██████████| 2/2 [00:00<00:00, 1254.09query/s]
Downloading: 100%|██████████| 66976/66976 [00:01<00:00, 52505.81rows/s]

,state,county,county_state_id,admin_level,district_nces_id,district_state_id,district_state_type,district,ccd_district_type,ccd_charter,...,ell,ell_percent,homeless,homeless_percent,low_income,free_and_reduced,free_and_reduced_percent,disability,section_504,total
0,UT,,,district,4900030.0,01,District,Alpine District,1.0,NOTCHR,...,3372.0,,72.0,,18660.0,,,8128.0,,81532
1,UT,,,district,4900060.0,02,District,Beaver District,1.0,NOTCHR,...,61.0,,0.0,,628.0,,,217.0,,1524
2,UT,,,district,4900090.0,03,District,Box Elder District,1.0,NOTCHR,...,364.0,,80.0,,4316.0,,,1328.0,,11914
3,UT,,,district,4900120.0,04,District,Cache District,1.0,NOTCHR,...,668.0,,78.0,,5980.0,,,2293.0,,18802
4,UT,,,district,4900142.0,42,District,Canyons District,1.0,NOTCHR,...,2700.0,,1277.0,,9668.0,,,3778.0,,34178
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
66971,UT,,,school,4900450.0,15,District,Juab District,,,...,0.0,,0.0,,142.0,,,47.0,,319
66972,UT,,,school,4900450.0,15,District,Juab District,,,...,0.0,,0.0,,129.0,,,35.0,,292
66973,UT,,,school,4900450.0,15,District,Juab District,,,...,0.0,,1.0,,236.0,,,95.0,,671
66974,UT,,,school,4900450.0,15,District,Juab District,,,...,0.0,,0.0,,209.0,,,104.0,,673
66975,UT,,,school,4900203.0,4M,Charter,Mountain Sunrise Academy,,,...,0.0,,0.0,,140.0,,,1.0,,382